Autodesk.Revit.DB.Material.Duplicate(System.String)
Duplicates the material
Remarks:
If duplication fails for reasons unrelated to the name, null will be returned.
name:
Name of the new material - this name must be correctly structured for Revit use and not duplicate the name
of another material in the document.
Returns:
The new material.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
-or-
The given value for name is already in use as a material element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Material.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new material.
document:
The document in which to create the material.
name:
The name of the new material.
Returns:
Identifier of the new material.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
-or-
The given value for name is already in use as a material element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null